app/controllers/pins_controller.rb

  def index
    @pins = Pin.all
---
SELECT "pins".* FROM "pins"  ORDER BY "pins"."id" ASC

  def create
    @pin = Pin.new(pin_params)
    # if the pin saves successfully
    if @pin.save
---
INSERT INTO "pins" ("name", "url", "image", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def edit
    @pin = Pin.find_by_id params[:id]
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 1]]

  def destroy
    @pin = Pin.find_by_id params[:id]
    @pin.destroy
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "pins" WHERE "pins"."id" = $1  [["id", 1]]